const msgJp = {
  VALID_001: "{1}は必須項目です。",
  VALID_002: "{1}は{2}文字以下で入力してください。",
  VALID_003: "{1}は{2}文字以上で入力してください。",
  VALID_004: "郵便番号を - を入れて入力してください。",
  VALID_005: "カナで入力してください。",
  VALID_006: "{1}は必須項目です。",
  VALID_007: "{1}は{2}文字以下で入力してください。",
  VALID_008: "{1}は{2}文字以上で入力してください。",
  VALID_009: "{1}を選択してください。",
  VALID_010: "{1}は必須項目です。",
  VALID_011: "{1}は必須項目です。",
  VALID_012: "{1}を選択してください。",
  VALID_013: "ファイルタイプは、{1}である必要があります。",
  VALID_014: "ユーザーIDは必須項目です。",
  VALID_015: "ユーザーIDはメールアドレスの形式で入力してください。",
  VALID_016: "メールアドレスは必須項目です。",
  VALID_017: "有効なメールアドレスを入力してください。",
  VALID_018: "パスワードは必須項目です。",
  VALID_019: "パスワードは8-32文字の英数字と記号で入力してください。",
  VALID_020: "パスワードは{1}文字以下で入力してください。",
  VALID_021: "パスワードは{1}文字以上で入力してください。",
  VALID_022: "日付を入力してください。",
  VALID_023: "日付のフォーマットが正しくありません。",
  VALID_024: "日付のフォーマットが正しくありません。",
  VALID_025: "日付を入力してください。",
  VALID_026: "日付のフォーマットが正しくありません。",
  VALID_027: "日付のフォーマットが正しくありません。",
  VALID_028: "日付を入力してください。",
  VALID_029: "日付のフォーマットが正しくありません。",
  VALID_030: "日付のフォーマットが正しくありません。",
  VALID_031: "週を入力してください。",
  VALID_032: "週のフォーマットが正しくありません。",
  VALID_033: "時間を入力してください。",
  VALID_034: "時間のフォーマットが正しくありません。",
  VALID_035: "数値を入力してください。",
  VALID_036: "{1}は{2}以下で入力してください。",
  VALID_037: "{1}は{2}以上で入力してください。",
  VALID_038: "電話番号を入力してください。",
  VALID_039: "電話番号は10桁か11桁の数値で入力してください。",
  VALID_040: "FAX番号を入力してください。",
  VALID_041: "FAX番号は10桁か11桁の数値で入力してください。",
  VALID_042: "URLは必須項目です。",
  VALID_043: "有効なURLを入力してください。",
  VALID_044: "{1}は必須項目です。",
  VALID_045: "{1}は{2}文字以下で入力してください。",
  VALID_046: "{1}は{2}文字以上で入力してください。",
  VALID_047: "ユーザーIDは{1}文字以下で入力してください。",
  VALID_048: "ユーザーIDは{1}文字以上で入力してください。",
  VALID_049: "メールアドレスは{1}文字以下で入力してください。",
  VALID_050: "メールアドレスは{1}文字以上で入力してください。",

  "CMN0001-I": "必須項目が未入力です",
  "CMN0002-I":
    "郵便番号（半角数値）ハイフン付き 以外の文字が含まれているか、入力可能な文字数を超えています。入力可能最大文字数：8文字",
  "CMN0001-W":
    "IDまたはパスワードが正しくありません。もう一度入力してください。",
  "CMN0002-W": "パスワードとパスワード（確認用）の内容が違います。",
  "CMN0003-W":
    "パスワードの更新に失敗しました。システム管理者にお問い合わせください。",
  "CMN0004-W":
    "パスワードの条件を満たしていません。パスワードには大文字英字、小文字英字、数字、記号（!\"#$%&'()*+,-./:;<=>?@[]^_`{|}~）のすべての文字種を使用してください。",
  "CMN0005-W": "パスワードが正しくありません。もう一度入力してください。",
  "CMN0006-W": "{0}に失敗しました。システム管理者にお問い合わせください。",
  "CMN0012-I": "パスワードの更新に成功しました。",
  "CMN0013-I": "ご利用台数は1台以上入力してください。",
  "CMN0015-I": "{0}に過去の日付は選択できません。",
  "CMN0016-I": "パスワード再設定メールを送信しました。",
  "CMN0017-I": "{0}は{1}の範囲内で、存在する日付を入力してください。",
  "CMN0018-I":
    "CSVファイルのフォーマットに誤りがあります。CSVファイルの内容を修正して、改めて登録してください。",
  "CMN0019-I": "1回の取込上限は30件です。",
  "CMN0020-I": "日割りでの契約はできません。{0}を選んでください",
  "CMN0021-I": "日割りでの契約はできません。{0}または{1}を選んでください",

  "CLT0002-W": "未登録のメールアドレスです。",
  "CLT0003-W":
    "ログイン処理の失敗回数が規定回数を越えました。アカウントをロックします。解除についてはシステム管理者にお問い合わせください。",
  "CLT0004-W":
    "アカウントがロックされています。システム管理者にお問い合わせください。",
  "CLT0010-I": "入力可能な文字数、{0}文字を超えています。",
  "CLT0005-I": "ファイルサイズは{0}MB以下で登録してください。",
  "CLT0007-I": "登録可能なファイル数は{0}個以下となります。",
  "CLT0003-I": "利用終了日は、利用開始日より大きい日付を入力してください",
  "CLT0008-I": "{0}は、{1}よりも後の日付を入力してください",
  "CLT0011-I": "編集中の内容は破棄されます。よろしいですか？",
  "CLT0012-I": "利用開始日は、利用終了日より前の日付を入力してください",
  "CLT0013-I":
    "地図上のピンを操作して、工事現場の出入り口付近にピンを合わせてください。",

  "USR0001-E": "システムオーナーのロールの変更は出来ません。",
  "USR0002-E": "システムオーナーをロックすることは出来ません。",

  mess_google_map_not_found: "出発地点か目的地が不正です。",
  mess_google_map_zero_results: "ルートが見つかりませんでした。",
  mess_google_map_max_waypoints_exceeded: "waypointsが多すぎます。",
  mess_google_map_max_route_length_exceeded: "ルートが長すきます",
  mess_google_map_over_daily_limit:
    "APIキーが無効になっているか、支払いに問題がある可能性があります",
  mess_google_map_over_query_limit:
    "リクエストの上限に達している可能性があります",
  mess_google_map_request_denied: "リクエストが拒否されました",
  mess_google_map_invalid_request: "パラメータが不足しています",
  mess_google_map_unknown_error:
    "サーバーエラーのため、リクエストが処理できません",
  mess_cancel_request_successful: "依頼をキャンセルしました。",
  mess_comment_apply_successful: "発注承認申請を行いました。",
  mess_project_start_date_after_end_date:
    "工事開始日は、工事完了日より前の日付を入力してください",
  mess_project_completion_date_after_start_date:
    "工事完了日は、工事開始日よりも後の日付を入力してください",
  mess_csv_error_format:
    "CSVファイルのフォーマットに誤りがあります。CSVファイルの内容を修正して、改めて登録してください。",

  CUSTOMER_ID_LOGIN: "会社 ID が必要です。",
};

export default msgJp;
